import { Component } from '@angular/core';
import { ActivatedRoute } from '@angular/router';
import Swal from 'sweetalert2';
declare var $:any
@Component({
  selector: 'app-global-medical',
  templateUrl: './global-medical.component.html',
  styleUrls: ['./global-medical.component.scss']
})
export class GlobalMedicalComponent {
  type:any;
  target:any;
  imgSrc:any
  insuranceDescription:any=''
  constructor(private _ActivatedRoute:ActivatedRoute){
    this._ActivatedRoute.params.subscribe((data:any)=>{
      this.type = data.type
      this.target = data.target
    })
  }
  getInsuranceType(type:any){
    console.log(type);
    if(type=='companies'){
      $(".companies").show(500)
      $(".Indiviual").hide(500)
      // this.insuranceDescription=' يوفر لك راحة البال مع خدمات الرعاية الطبية التي تحتاجها للسفر في جميع أنحاء العالم لتحصل أنت وعائلتك على العناية التي تستحقونها  يوفر لك برنامج التأمين الطبي العالمي لدينا إمكانية الاستفادة من شبكة عالمية من المستشفيات ومقدمي الرعاية الصحيةلتنعم بعلاج على مستوى عالمي لكل حالة طبية تواجهها، وتشمل برامج التأمين لدينا والقابلة للتعديل والتخصيص ما يلي التدخل الجراحي التشخيص العلاج في حالات الطوارئ الاستشارات الطبية دخول المستشفيات خدمات أخرى'
      this.insuranceDescription=' يوفر لك راحة البال مع خدمات الرعاية الطبية التي تحتاجها في حالة التواجد في الخارج / الإقامة في الخارج لتحصل أنت وعائلتك على العناية التي تستحقونها  يوفر لك برنامج التأمين الطبي العالمي لدينا إمكانية الاستفادة من شبكة عالمية من المستشفيات ومقدمي الرعاية الصحيةلتنعم بعلاج على مستوى عالمي لكل حالة طبية تواجهها، وتشمل برامج التأمين لدينا والقابلة للتعديل والتخصيص ما يلي التدخل الجراحي التشخيص العلاج في حالات الطوارئ الاستشارات الطبية دخول المستشفيات خدمات أخرى'
    }else if(type=='individual'){
      $(".Indiviual").show(500)
      $(".companies").hide(500)
      this.insuranceDescription=' يوفر لك راحة البال مع خدمات الرعاية الطبية التي تحتاجها في حالة التواجد في الخارج / الإقامة في الخارج لتحصل أنت وعائلتك على العناية التي تستحقونها  يوفر لك برنامج التأمين الطبي العالمي لدينا إمكانية الاستفادة من شبكة عالمية من المستشفيات ومقدمي الرعاية الصحيةلتنعم بعلاج على مستوى عالمي لكل حالة طبية تواجهها، وتشمل برامج التأمين لدينا والقابلة للتعديل والتخصيص ما يلي التدخل الجراحي التشخيص العلاج في حالات الطوارئ الاستشارات الطبية دخول المستشفيات خدمات أخرى'

      // this.insuranceDescription=' يوفر لك راحة البال مع خدمات الرعاية الطبية التي تحتاجها للسفر في جميع أنحاء العالم لتحصل أنت وعائلتك على العناية التي تستحقونها  يوفر لك برنامج التأمين الطبي العالمي لدينا إمكانية الاستفادة من شبكة عالمية من المستشفيات ومقدمي الرعاية الصحيةلتنعم بعلاج على مستوى عالمي لكل حالة طبية تواجهها، وتشمل برامج التأمين لدينا والقابلة للتعديل والتخصيص ما يلي التدخل الجراحي التشخيص العلاج في حالات الطوارئ الاستشارات الطبية دخول المستشفيات خدمات أخرى'
    }
  }



 
  ngOnInit(): void {
    this.getInsuranceType(this.type)
    $("html , body").animate({scrollTop:0} ,0)
  }
}
